tests/data/events/updateOrder/hook.events.paymentStatusChange.expired.json

{
    "success": true,
    "call_id": "662e92f7db6eb",
    "request": {
        "headers": {
            "host": [
                "junmar-wp.code4.pizza"
            ],
            "user_agent": [
                "GuzzleHttp\/7"
            ],
            "content_length": [
                "1907"
            ],
            "accept_encoding": [
                "gzip"
            ],
            "cdn_loop": [
                "cloudflare"
            ],
            "cf_connecting_ip": [
                "2a01:4f9:5a:1c8a::2"
            ],
            "cf_ipcountry": [
                "FI"
            ],
            "cf_ray": [
                "87b90e147eac0109-AMS"
            ],
            "cf_visitor": [
                "{\"scheme\":\"http\"}"
            ],
            "cf_warp_tag_id": [
                "397aecd1-040c-47aa-a53b-89ed30c83997"
            ],
            "connection": [
                "keep-alive"
            ],
            "content_type": [
                "application\/json"
            ],
            "upxhooktoken": [
                "e7c433888a2aa9684c2d1120baa5a28641e65205bf6d1531fe82c512ca0a375d"
            ],
            "x_forwarded_for": [
                "2a01:4f9:5a:1c8a::2"
            ],
            "x_forwarded_proto": [
                "http"
            ]
        },
        "body": "{\"action\":\"events\",\"payload\":{\"date_newest\":\"2024-04-28 20:18:24+02\",\"backref\":\"ShopModule::Order(id=951)\",\"events\":{\"13248\":{\"id\":13248,\"event\":\"payment_status_change\",\"details\":{\"order\":{\"id\":\"951\",\"number\":\"S29-27\",\"status\":\"on_hold\",\"is_paid\":false,\"shop_id\":\"29\",\"is_contract\":false,\"is_quote\":false,\"location_id\":\"2\"},\"payment\":{\"id\":\"664\",\"provider_id\":\"10\",\"method\":\"SandBox\",\"amount\":\"1210.0000\",\"currency_iso3\":\"EUR\",\"is_test\":false,\"title\":\"Bestelnummer: 27\",\"description\":null,\"reference_no\":null,\"metadata\":{\"product_sent_to_pay\":true},\"status\":\"expired\",\"date_created\":\"2024-04-28 17:44:11+02\",\"date_updated\":\"2024-04-28 20:18:24+02\",\"date_expires_on\":null,\"date_paid\":null,\"date_canceled\":null,\"date_expired\":null,\"date_refunded\":null,\"payment_url\":\"https:\\\/\\\/api.pay.nl\\\/controllers\\\/payments\\\/issuer.php?orderId=2435920041X56553&entranceCode=33f3d549e1b561bab02df241efeb9abcde5d1758&profileID=613&lang=NL\",\"redirect_url\":\"http:\\\/\\\/junmar-wp.code4.pizza\\\/?wc-api=backoffice_pay_gateway_return&utm_nooverride=1&wc-order-id=27&trx=662e6ecb-0dd9-4e70-a312-8e97987beb62\",\"eid\":\"2435920041X56553\",\"relation_data_id\":\"278\",\"amount_refunded\":null,\"amount_no_tax\":null,\"provider_method_id\":\"17\",\"parent_id\":null,\"trx\":\"662e6ecb-0dd9-4e70-a312-8e97987beb62\",\"amount_refunded_no_tax\":null,\"is_virtual\":false,\"relation_data_snapshot_id\":\"201\",\"end_user_ip\":\"172.26.0.1\",\"products\":\"[{\\\"sku\\\": \\\"Iphone 13 Pro Max\\\", \\\"name\\\": \\\"Apple Iphone 13 Pro Max\\\", \\\"ppu_wt\\\": \\\"1210.00\\\", \\\"quantity\\\": 1, \\\"is_payment\\\": false, \\\"is_discount\\\": false, \\\"is_shipping\\\": false}]\",\"provider_method_option_type_id\":null,\"sales_person_id\":null,\"order_number\":null,\"invoice_number\":null,\"provider_method\":{\"id\":\"17\",\"title\":\"iDEAL\",\"eid\":\"10\",\"image_url\":\"https:\\\/\\\/static.pay.nl\\\/payment_profiles\\\/50x50\\\/10.png\",\"image_big_url\":null,\"provider_method_type_id\":\"1\",\"extra\":null}}},\"date\":\"2024-04-28 20:18:24+02\"}}}}",
        "route": "\/storekeeper-woocommerce-b2c\/v1\/webhook",
        "method": "POST",
        "query_params": {
            "rest_route": "\/storekeeper-woocommerce-b2c\/v1\/webhook\/"
        },
        "file_params": []
    },
    "hook_action": "events",
    "return": true,
    "_type": "hook",
    "time_ms": 1086.0,
    "_version": "1.0",
    "_timestamp": "2024-04-28T18:18:32+00:00"
}